<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<!--Converted with LaTeX2HTML 2008 (1.71)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Glosario de t&#233;rminos</TITLE>
<META NAME="description" CONTENT="Glosario de t&#233;rminos">
<META NAME="keywords" CONTENT="memtfg">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="LaTeX2HTML v2008">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="memtfg.css">

<LINK REL="next" HREF="node39.html">
<LINK REL="previous" HREF="node32.html">
<LINK REL="up" HREF="memtfg.html">
<LINK REL="next" HREF="node39.html">
</HEAD>

<BODY >

<DIV CLASS="navigation"><!--Navigation Panel-->
<A NAME="tex2html769"
  HREF="node39.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="./icons/next.png"></A> 
<A NAME="tex2html763"
  HREF="memtfg.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="./icons/up.png"></A> 
<A NAME="tex2html757"
  HREF="node37.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="./icons/prev.png"></A> 
<A NAME="tex2html765"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents"
 SRC="./icons/contents.png"></A> 
<A NAME="tex2html767"
  HREF="node61.html">
<IMG WIDTH="43" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="index"
 SRC="./icons/index.png"></A> 
<BR>
<B> Siguiente:</B> <A NAME="tex2html770"
  HREF="node39.html">Gu&#237;a de usuario</A>
<B> Subir:</B> <A NAME="tex2html764"
  HREF="memtfg.html">memtfg</A>
<B> Anterior:</B> <A NAME="tex2html758"
  HREF="node37.html">Coste y duraci&#243;n total</A>
 &nbsp; <B>  <A NAME="tex2html766"
  HREF="node1.html">&#205;ndice General</A></B> 
 &nbsp; <B>  <A NAME="tex2html768"
  HREF="node61.html">&#205;ndice de Materias</A></B> 
<BR>
<BR></DIV>
<!--End of Navigation Panel-->

<H1><A NAME="SECTION001200000000000000000"></A>
<A NAME="appendix:1"></A>
<BR>
Glosario de t&#233;rminos
</H1>
<B><BIG CLASS="XHUGE">A</BIG></B><A NAME="Apendice1:A"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3038">AJAX</SPAN><A NAME="apend1:ajax"></A></STRONG></DT>
<DD>: acr&#243;nimo de <SPAN  CLASS="textit">Asynchronous JavaScript And XML</SPAN> (JavaScript as&#237;ncrono y XML). Es una t&#233;cnica de desarrollo web para crear aplicaciones 
  interactivas o RIA (<SPAN  CLASS="textit">Rich Internet Applications</SPAN>). Estas aplicaciones se ejecutan en el cliente, es decir, en el navegador de los usuarios mientras se 
  mantiene la comunicaci&#243;n as&#237;ncrona con el servidor en segundo plano. De esta forma es posible realizar cambios sobre las p&#225;ginas sin necesidad de 
  recargarlas, mejorando la interactividad, velocidad y usabilidad en las aplicaciones.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3044">API</SPAN><A NAME="apend1:api"></A></STRONG></DT>
<DD>: (<SPAN  CLASS="textit">Application Programming Interface</SPAN> o Interfaz de Programaci&#243;n de Aplicaciones). Conjunto de funciones y procedimientos o m&#233;todos que 
  ofrece cierta librer&#237;a para ser utilizados por otro software como una capa de abstracci&#243;n. 
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3048">AutoQCM</SPAN><A NAME="apend1:aqcm"></A></STRONG></DT>
<DD>: formato perteneciente al software <B>Auto Multiple Choice</B>. Dise&#241;ado para crear y manegar cuestionarios multirrespuesta con correci&#243;n
  autom&#225;tica. Para m&#225;s informaci&#243;n, visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html44"
  HREF="http://home.gna.org/auto-qcm">http://home.gna.org/auto-qcm</A></TT></SMALL>.
</DD>
</DL>

<P>

<P><P>
<BR>
<B><BIG CLASS="XHUGE">B</BIG></B><A NAME="Apendice1:B"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3057">Bootstrap</SPAN><A NAME="apend1:bootstrap"></A></STRONG></DT>
<DD>: framework o conjunto de herramientas de software libre para dise&#241;o de sitios y aplicaciones web. 
  Contiene plantillas de dise&#241;o con tipograf&#237;a, formularios, botones, cuadros, men&#250;s de navegaci&#243;n y otros elementos de dise&#241;o basado en HTML 
  y CSS, as&#237; como extensiones de JavaScript opcionales adicionales. Para m&#225;s informaci&#243;n, visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html45"
  HREF="http://getbootstrap.com/">http://getbootstrap.com/</A></TT></SMALL>.
  
<P><P>
<BR>
</DD>
</DL>

<P>

<P><P>
<BR>
<B><BIG CLASS="XHUGE">C</BIG></B><A NAME="Apendice1:C"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3069">CDN</SPAN><A NAME="apend1:cdn"></A></STRONG></DT>
<DD>: (<SPAN  CLASS="textit">Content Delivery Network</SPAN> o Red de Entrega de Contenidos). Red superpuesta de computadoras que contienen copias de datos, colocados en 
  varios puntos de una red con el fin de maximizar el ancho de banda para el acceso a los datos de clientes por la red. Un cliente accede a una copia de la informaci&#243;n cerca 
  del cliente, en contraposici&#243;n a todos los clientes que acceden al mismo servidor central, a fin de evitar embudos cerca de ese servidor.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3072">Chai</SPAN><A NAME="apend1:chai"></A></STRONG></DT>
<DD>: librer&#237;a de asersiones TDD que puede incluirse con alg&#250;n framework de test JavaScript (como, por ejemplo, Mocha). Para m&#225;s informaci&#243;n, 
  visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html46"
  HREF="http://chaijs.com/">http://chaijs.com/</A></TT></SMALL>.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3076">Cliente-Servidor</SPAN><A NAME="apend1:cs"></A></STRONG></DT>
<DD>: modelo de aplicaci&#243;n distribuida en el que las tareas se reparten entre los proveedores de recursos o servicios, llamados servidores, 
  y los demandantes, llamados clientes. Un cliente realiza peticiones a otro programa, el servidor, quien le da respuesta.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3078">CodeMirror</SPAN><A NAME="apend1:codemirror"></A></STRONG></DT>
<DD>: editor de texto implementado en JavaScript para usar desde el navegador. Para m&#225;s informaci&#243;n, visitar 
  <SMALL CLASS="SMALL"><TT><A NAME="tex2html47"
  HREF="http://codemirror.net/">http://codemirror.net/</A></TT></SMALL>.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3081">CVS</SPAN><A NAME="apend1:cvs"></A></STRONG></DT>
<DD>: (<SPAN  CLASS="textit">Concurrent Versioning System</SPAN> o Sistema de Control de Versiones). Aplicaci&#243;n inform&#225;tica que implementa un sistema de control de 
  versiones: mantiene el registro de todo el trabajo y los cambios en los ficheros (c&#243;digo fuente principalmente) que forman un proyecto y permite que distintos desarrolladores 
  (potencialmente situados a gran distancia) colaboren.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3084">CSS3</SPAN><A NAME="apend1:css"></A></STRONG></DT>
<DD>: (<SPAN  CLASS="textit">Cascading Style Sheets</SPAN> o Hoja de Estilos en Cascada). Lenguaje de hojas de estilo utilizado para describir el aspecto y el formato de un 
  documento escrito en un lenguaje de marcas, como HTML. CSS3 es la versi&#243;n m&#225;s reciente de este lenguaje.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3087">CSV</SPAN><A NAME="apend1:csv"></A></STRONG></DT>
<DD>: (<SPAN  CLASS="textit">Comma-Separated Values</SPAN>). Tipo de documento en formato abierto sencillo para representar datos en forma de tabla, en las que las columnas se 
  separan por comas y las filas por saltos de l&#237;nea. 
  
<P><P>
<BR>
</DD>
</DL>

<P>

<P><P>
<BR>
<B><BIG CLASS="XHUGE">D</BIG></B><A NAME="Apendice1:D"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3095">DSL</SPAN><A NAME="apend1:dsl"></A></STRONG></DT>
<DD>: (<SPAN  CLASS="textit">Domain Specific Language</SPAN> o Lenguaje de Dominio Espec&#237;fico). En desarrollo de software, un lenguaje de dominio espec&#237;fico es 
  un lenguaje de programaci&#243;n o especificaci&#243;n de un lenguaje dedicado a resolver un problema en particular, representar un problema espec&#237;fico 
  y proveer una t&#233;cnica para solucionar una situaci&#243;n particular. 
</DD>
</DL>

<P>

<P><P>
<BR>
<B><BIG CLASS="XHUGE">E</BIG></B><A NAME="Apendice1:E"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3105">ERB</SPAN><A NAME="apend1:erb"></A></STRONG></DT>
<DD>: (<SPAN  CLASS="textit">Embedded Ruby</SPAN>). Sistema de plantillas que incrusta c&#243;digo Ruby en un documento HTML. Est&#225; inclu&#237;do en el n&#250;cleo de Ruby.
</DD>
</DL>

<P><P>
<BR>

<P>

<P><P>
<BR>
<B><BIG CLASS="XHUGE">F</BIG></B><A NAME="Apendice1:F"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3113">Footer</SPAN><A NAME="apend1:footer"></A></STRONG></DT>
<DD>: texto que se encuentra separado del texto principal del documento y que aparece al final de la p&#225;gina del mismo.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3115">Fork</SPAN><A NAME="apend1:fork"></A></STRONG></DT>
<DD>: en desarrollo de software, el fork es la acci&#243;n de realizar una copia exacta de un proyecto a partir de otro y contiene todo el c&#243;digo fuente 
  listo para empezar un desarrollo independiente haciendo uso del mismo.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3117">Frameworks</SPAN><A NAME="apend1:framework"></A></STRONG></DT>
<DD>: (marcos de trabajo). En el desarrollo de software, es una estructura conceptual y tecnol&#243;gica de soporte definido, normalmente con 
artefactos   o m&#243;dulos de software concretos, que puede servir de base para la organizaci&#243;n y desarrollo de software. T&#237;picamente, puede incluir soporte de programas, bibliotecas y 
  un lenguaje interpretado, entre otras herramientas, para as&#237; ayudar a desarrollar y unir los diferentes componentes de un proyecto.
  
<P><P>
<BR>
</DD>
</DL>

<P>
<B><BIG CLASS="XHUGE">G</BIG></B><A NAME="Apendice1:G"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3125">Gamificaci&#243;n</SPAN><A NAME="apend1:gamificacion"></A></STRONG></DT>
<DD>: uso de t&#233;cnicas y din&#225;micas propias de los juegos y el ocio en actividades no recreativas, como puede ser en actividades de 
  aprendizaje.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3127">Gema</SPAN><A NAME="apend1:gema"></A></STRONG></DT>
<DD>: programa o biblioteca escrito en Ruby que proporciona una serie de m&#233;todos para extender la funcionalidad del lenguaje Ruby. Para m&#225;s 
  informaci&#243;n, visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html48"
  HREF="https://rubygems.org/">https://rubygems.org/</A></TT></SMALL>.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3130">Gemfile</SPAN><A NAME="apend1:gemfile"></A></STRONG></DT>
<DD>: fichero de Ruby en el que se especifican todas las gemas de las que depende un proyecto o programa para que funcione correctamente.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3132">Google Drive</SPAN><A NAME="apend1:drive"></A></STRONG></DT>
<DD>: servicio de alojamiento de archivos accesible desde su p&#225;gina web mediante ordenadores o mediante aplicaciones m&#243;viles. Para m&#225;s 
  informaci&#243;n, visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html49"
  HREF="https://drive.google.com">https://drive.google.com</A></TT></SMALL>.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3135">GitHub</SPAN><A NAME="apend1:github"></A></STRONG></DT>
<DD>: forja para alojar proyectos utilizando el Sistema de Control de Versiones <B>Git</B>. Para m&#225;s informaci&#243;n, visitar <SMALL CLASS="SMALL">  <TT><A NAME="tex2html50"
  HREF="https://github.com">https://github.com</A></TT></SMALL>.
  
<P><P>
<BR>
</DD>
</DL>

<P>

<P><P>
<BR>
<B><BIG CLASS="XHUGE">H</BIG></B><A NAME="Apendice1:H"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3143">Header</SPAN><A NAME="apend1:header"></A></STRONG></DT>
<DD>: texto que se encuentra separado del texto principal del documento y que aparece al comienzo de la p&#225;gina del mismo.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3145">Heroku</SPAN><A NAME="apend1:heroku"></A></STRONG></DT>
<DD>: plataforma como servicio (<SPAN  CLASS="textit">PaaS</SPAN>) de computaci&#243;n en la Nube que permite, entre otras cosas, alojar aplicaciones web. Para m&#225;s 
  informaci&#243;n, visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html51"
  HREF="https://www.heroku.com/">https://www.heroku.com/</A></TT></SMALL>.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3149">HTML5</SPAN><A NAME="apend1:html"></A></STRONG></DT>
<DD>: (<SPAN  CLASS="textit">HyperText Markup Language</SPAN>). Lenguaje de marcado para la elaboraci&#243;n de p&#225;ginas web. Es un est&#225;ndar que sirve de referencia para la 
  elaboraci&#243;n de p&#225;ginas web definiendo una estructura b&#225;sica y un c&#243;digo para la definici&#243;n del contenido de la misma.
  
<P><P>
<BR>
</DD>
</DL>

<P>

<P><P>
<BR>

<P>
<B><BIG CLASS="XHUGE">J</BIG></B><A NAME="Apendice1:J"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3156">JavaScript</SPAN><A NAME="apend1:js"></A></STRONG></DT>
<DD>: lenguaje de programaci&#243;n interpretado. Se define como orientado a objetos, basado en prototipos, imperativo, d&#233;bilmente tipado y 
  din&#225;mico. Se utiliza principalmente en su forma del lado del cliente (<SPAN  CLASS="textit">client-side</SPAN>), implementado como parte de un navegador web permitiendo mejoras en la interfaz de usuario y p&#225;ginas 
web din&#225;micas.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3159">jQuery</SPAN><A NAME="apend1:jquery"></A></STRONG></DT>
<DD>: librer&#237;a de JavaScript, que permite simplificar la manera de interactuar con los documentos HTML, manipular el &#225;rbol DOM, manejar 
  eventos, desarrollar animaciones y agregar interacci&#243;n con la t&#233;cnica AJAX a p&#225;ginas web. Para m&#225;s informaci&#243;n, visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html52"
  HREF="https://jquery.com/">https://jquery.com/</A></TT></SMALL>.
  
<P><P>
<BR>
</DD>
</DL>

<P>

<P><P>
<BR>
<B><BIG CLASS="XHUGE">K</BIG></B><A NAME="Apendice1:K"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3167">Karma</SPAN><A NAME="apend1:karma"></A></STRONG></DT>
<DD>: librer&#237;a JavaScript que proporciona un entorno configurable y personalizable de testing que permite la 
  integraci&#243;n continua de los mismos. Para m&#225;s informaci&#243;n, visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html53"
  HREF="https://karma-runner.github.io/0.12/index.html">https://karma-runner.github.io/0.12/index.html</A></TT></SMALL>.
  
<P><P>
<BR>
</DD>
</DL>

<P>

<P><P>
<BR>
<B><BIG CLASS="XHUGE">L</BIG></B><A NAME="Apendice1:L"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3175">Lambda</SPAN><A NAME="apend1:lambda"></A></STRONG></DT>
<DD>: objeto en Ruby que representa un bloque, es decir, un trozo de c&#243;digo Ruby asociado con la invocaci&#243;n de un m&#233;todo. Las lambdas tambi&#233;n 
  reciben el nombre de Procs.
  
<P><P>
<BR>
</DD>
</DL>

<P>

<P><P>
<BR>
<B><BIG CLASS="XHUGE">M</BIG></B><A NAME="Apendice1:M"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3181">MathJax</SPAN><A NAME="apend1:mathjax"></A></STRONG></DT>
<DD>: librer&#237;a de JavaScript que permite mostrar signos y elementos matem&#225;ticos en los documentos HTML. Para m&#225;s informaci&#243;n, 
  visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html54"
  HREF="http://www.mathjax.org/">http://www.mathjax.org/</A></TT></SMALL>.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3185">Metodologias &#225;giles</SPAN><A NAME="apend1:ma"></A></STRONG></DT>
<DD>: conjunto de m&#233;todos de ingenier&#237;a del software basados en el desarrollo iterativo e incremental, donde los requisitos y 
  soluciones evolucionan mediante la colaboraci&#243;n de grupos auto organizados y multidisciplinarios. Se caracterizan adem&#225;s por la minimizaci&#243;n de riesgos desarrollando software en
  iteraciones cortas de tiempo.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3188">Mocha</SPAN><A NAME="apend1:mocha"></A></STRONG></DT>
<DD>: framework de test para c&#243;digo JavaScript. Para m&#225;s informaci&#243;n, visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html55"
  HREF="https://visionmedia.github.io/mocha/">https://visionmedia.github.io/mocha/</A></TT></SMALL>.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3191">Moodle</SPAN><A NAME="apend1:moodle"></A></STRONG></DT>
<DD>: aplicaci&#243;n web de tipo Ambiente Educativo Virtual. Es un sistema de gesti&#243;n de cursos, de distribuci&#243;n libre, que ayuda a los profesores a 
  crear comunidades de aprendizaje en l&#237;nea. Este tipo de plataformas tecnol&#243;gicas tambi&#233;n se conoce como LCMS (<SPAN  CLASS="textit">Learning Content Management System</SPAN>). Para m&#225;s informaci&#243;n, 
  visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html56"
  HREF="https://moodle.org/?lang=es">https://moodle.org/?lang=es</A></TT></SMALL>.
  
<P><P>
<BR>
</DD>
</DL>

<P>

<P><P>
<BR>
<B><BIG CLASS="XHUGE">O</BIG></B><A NAME="Apendice1:O"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3200">OAuth 2.0</SPAN><A NAME="apend1:oauth"></A></STRONG></DT>
<DD>: (<SPAN  CLASS="textit">Open Authorization</SPAN>): protocolo abierto que permite la autorizaci&#243;n segura de una API de modo est&#225;ndar y simple para 
  aplicaciones de escritorio, web y m&#243;viles. Para m&#225;s informaci&#243;n, visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html57"
  HREF="http://oauth.net/2/">http://oauth.net/2/</A></TT></SMALL>
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3204">Opal</SPAN><A NAME="apend1:opal"></A></STRONG></DT>
<DD>: gema de Ruby que compila c&#243;digo escrito en Ruby a c&#243;digo JavaScript. Para m&#225;s informaci&#243;n, visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html58"
  HREF="http://opalrb.org/">http://opalrb.org/</A></TT></SMALL>.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3207">Open EdX</SPAN><A NAME="apend1:openedx"></A></STRONG></DT>
<DD>: iniciativa de c&#243;digo abierto creada con el fin de crear la plataforma de aprendizaje online de nueva generaci&#243;n, que proporcionar&#225;
  una educaci&#243;n de mejor calidad a los estudiantes de todo el mundo. Para m&#225;s informaci&#243;n, visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html59"
  HREF="http://code.edx.org/">http://code.edx.org/</A></TT></SMALL>.
  
<P><P>
<BR>
</DD>
</DL>

<P>
<B><BIG CLASS="XHUGE">P</BIG></B><A NAME="Apendice1:P"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3214">Proc</SPAN><A NAME="apend1:proc"></A></STRONG></DT>
<DD>: objeto en Ruby que representa un bloque, es decir, un trozo de c&#243;digo Ruby asociado con la invocaci&#243;n de un m&#233;todo. Las procs tambi&#233;n reciben 
el nombre
  de Lambdas.
</DD>
</DL>

<P>

<P><P>
<BR>
<B><BIG CLASS="XHUGE">R</BIG></B><A NAME="Apendice1:R"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3220">Renderers</SPAN><A NAME="apend1:renderer"></A></STRONG></DT>
<DD>: generadores de cuestionarios en un determinado formato, como por ejemplo, HTML5.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3222">Ruby</SPAN><A NAME="apend1:ruby"></A></STRONG></DT>
<DD>: lenguaje de programaci&#243;n interpretado, reflexivo y orientado a objetos, creado por el programador japon&#233;s Yukihiro "Matz" 
  Matsumoto. Combina una sintaxis inspirada en Python y Perl con caracter&#237;sticas de programaci&#243;n orientada a objetos similares a Smalltalk. Comparte tambi&#233;n funcionalidad con otros lenguajes 
  de programaci&#243;n como Lisp, Lua, Dylan y CLU. Para m&#225;s informaci&#243;n, visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html60"
  HREF="https://www.ruby-lang.org/es">https://www.ruby-lang.org/es</A></TT></SMALL>.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3226">RuQL</SPAN><A NAME="apend1:ruql"></A></STRONG></DT>
<DD>: (<SPAN  CLASS="textit">Ruby-based Quiz Generator and DSL</SPAN>). Gema de Ruby que permite la elaboraci&#243;n de cuestionarios a partir de un fichero Ruby
  escrito usando un DSL propio de la gema. Este DSL se ha usado como base para elaborar este Trabajo de Fin de Grado. Para m&#225;s informaci&#243;n, visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html61"
  HREF="http://github.com/saasbook/ruql">http://github.com/saasbook/ruql</A></TT></SMALL>.
  
<P><P>
<BR>
</DD>
</DL>

<P>

<P><P>
<BR>
<B><BIG CLASS="XHUGE">S</BIG></B><A NAME="Apendice1:S"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3234">Sinatra</SPAN><A NAME="apend1:sinatra"></A></STRONG></DT>
<DD>: DSL que permite la r&#225;pida creaci&#243;n de aplicaciones web en Ruby. Para m&#225;s informaci&#243;n, visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html62"
  HREF="http://www.sinatrarb.com/">http://www.sinatrarb.com/</A></TT></SMALL>.
  
<P><P>
<BR>
</DD>
</DL>

<P>
<B><BIG CLASS="XHUGE">T</BIG></B><A NAME="Apendice1:T"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3241">TDD</SPAN><A NAME="apend1:tdd"></A></STRONG></DT>
<DD>: (<SPAN  CLASS="textit">Test-Driven Development</SPAN> o Desarrollo Dirigido por Pruebas). Pr&#225;ctica de programaci&#243;n que involucra otras dos pr&#225;cticas: escribir las 
  pruebas primero (<SPAN  CLASS="textit">Test First Development</SPAN>) y Refactorizaci&#243;n de c&#243;digo (<SPAN  CLASS="textit">Refactoring</SPAN>).
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3246">Template</SPAN><A NAME="apend1:template"></A></STRONG></DT>
<DD>: plantilla HTML en la cual se renderizar&#225; (incrustar&#225;) el contenido del cuestionario.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3248">Thin</SPAN><A NAME="apend1:thin"></A></STRONG></DT>
<DD>: gema de Ruby que implementa un servidor web r&#225;pido y ligero. Para m&#225;s informaci&#243;n, visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html63"
  HREF="https://rubygems.org/gems/thin">https://rubygems.org/gems/thin</A></TT></SMALL>.
  
<P><P>
<BR>
</DD>
</DL>

<P>

<P><P>
<BR>
<B><BIG CLASS="XHUGE">W</BIG></B><A NAME="Apendice1:W"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3255">WeBrick</SPAN><A NAME="apend1:webrick"></A></STRONG></DT>
<DD>: librer&#237;a de Ruby que proporciona un sencillo servidor web. Est&#225; inclu&#237;do en el n&#250;cleo de Ruby. 
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3259">Web sem&#225;ntica</SPAN><A NAME="apend1:web"></A></STRONG></DT>
<DD>: idea de a&#241;adir metadatos sem&#225;nticos y ontol&#243;gicos a la World Wide Web. Esas informaciones adicionales, que describen el contenido, 
  el significado y la relaci&#243;n de los datos, se deben proporcionar de manera formal, para que sea posible evaluarlas autom&#225;ticamente por m&#225;quinas de procesamiento. El objetivo es mejorar 
  Internet ampliando la interoperabilidad entre los sistemas inform&#225;ticos usando <B>agentes inteligentes</B>, es decir, programas en las computadoras que buscan informaci&#243;n sin necesidad de 
  interacci&#243;n humana.
  
<P><P>
<BR>

<P>
</DD>
<DT><STRONG><SPAN ID="txt3263">World Wide Web</SPAN><A NAME="apend1:www"></A></STRONG></DT>
<DD>: (WWW). Sistema de distribuci&#243;n de documentos de hipertexto o hipermedios interconectados y accesibles v&#237;a Internet. Con un navegador 
  web, un usuario visualiza sitios web compuestos de p&#225;ginas web que pueden contener texto, im&#225;genes, v&#237;deos u otros contenidos multimedia, y navega a trav&#233;s de esas p&#225;ginas usando 
hiperenlaces.
  
<P><P>
<BR>
</DD>
</DL>

<P>

<P><P>
<BR>
<B><BIG CLASS="XHUGE">X</BIG></B><A NAME="Apendice1:X"></A>
<P><P>
<BR>

<P><P>
<BR>

<P>
<DL>
<DT><STRONG><SPAN ID="txt3271">XRegExp</SPAN><A NAME="apend1:xregexp"></A></STRONG></DT>
<DD>: librer&#237;a JavaScript que proporciona y extiende la funcionalidad de las <B>expresiones regulares</B> nativas de JavaScript. Para m&#225;s 
  informaci&#243;n, visitar <SMALL CLASS="SMALL"><TT><A NAME="tex2html64"
  HREF="http://xregexp.com/">http://xregexp.com/</A></TT></SMALL>.
  
<P><P>
<BR>
</DD>
</DL>

<P>

<DIV CLASS="navigation"><HR>
<!--Navigation Panel-->
<A NAME="tex2html769"
  HREF="node39.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="./icons/next.png"></A> 
<A NAME="tex2html763"
  HREF="memtfg.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="./icons/up.png"></A> 
<A NAME="tex2html757"
  HREF="node37.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="./icons/prev.png"></A> 
<A NAME="tex2html765"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents"
 SRC="./icons/contents.png"></A> 
<A NAME="tex2html767"
  HREF="node61.html">
<IMG WIDTH="43" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="index"
 SRC="./icons/index.png"></A> 
<BR>
<B> Siguiente:</B> <A NAME="tex2html770"
  HREF="node39.html">Gu&#237;a de usuario</A>
<B> Subir:</B> <A NAME="tex2html764"
  HREF="memtfg.html">memtfg</A>
<B> Anterior:</B> <A NAME="tex2html758"
  HREF="node37.html">Coste y duraci&#243;n total</A>
 &nbsp; <B>  <A NAME="tex2html766"
  HREF="node1.html">&#205;ndice General</A></B> 
 &nbsp; <B>  <A NAME="tex2html768"
  HREF="node61.html">&#205;ndice de Materias</A></B> </DIV>
<!--End of Navigation Panel-->
<ADDRESS>
Juan Jos&eacute;
2014-07-10
</ADDRESS>
</BODY>
</HTML>
